# -*- coding: utf-8 -*-
# @Author: libin
# @Date:   2023-08-09 19:59:37
# @E-mail: 1499237580@qq.com
# @Software: Sublime Text
import re
import pandas as pd

l1 = ['北京市', '天津市', '河北省', '山西省', 
      '内蒙古自治区', '辽宁省', '吉林省', '黑龙江省', 
                       '上海市', '江苏省', '浙江省', '安徽省', 
                       '福建省', '江西省', '山东省', '河南省', 
                       '湖北省', '湖南省', '广东省', '广西壮族自治区', 
                       '海南省', '重庆市', '四川省', '贵州省', 
                       '云南省', '西藏自治区', '陕西省', '甘肃省', 
                       '青海省', '宁夏回族自治区', '新疆维吾尔自治区']

l2 = ['2017.csv', '2017.csv', '2017.csv', '2017.csv', '2017.xls']
print([l for l in l2 if re.findall("^[0-9]{4}.csv", l)])
